Revit 2026 API

# MEPCalculationServerInfoServerName Property

---

The Name of the server.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ServerName { get; set; }
```
```vb
Public Property ServerName As String
	Get
	Set
```
```cpp
public:
property String^ ServerName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member ServerName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

MEPCalculationServerInfo Class

Autodesk.Revit.DB Namespace